mindThomas/STM32-libraries/Periphirals/STM32G4/SyncedPWMADC/SyncedPWMADC.cpp
		if (obj->SAMPLE_IN_EVERY_PWM_CYCLE) {
			// When sampling in every sample we only need to enable the DMA once
			// And then we disable the interrupt since it is now running
			__HAL_TIM_DISABLE_IT(&obj->hTimer, TIM_IT_UPDATE);
		}
		return;
	}
}

// ToDo: OBS! It's a very bad idea to put these callbacks in here.
// Consider to enable callback registration mechanism within HAL library or to handle the interrupt manually.
// ADC conversion completed interrupt
// Called from the ADC_DMAConvCplt when the DMA conversion is done
void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef *hadc)
{
	if (SyncedPWMADC::globalObject)
	{
		if (hadc->Instance == ADC1) {
			SyncedPWMADC::SamplingCompleted(SyncedPWMADC::globalObject, 1);
		} else if (hadc->Instance == ADC2) {
			SyncedPWMADC::SamplingCompleted(SyncedPWMADC::globalObject, 2);
		}
	}
}


#pragma GCC push_options
#pragma GCC optimize ("O3")
void SyncedPWMADC::SamplingCompleted(SyncedPWMADC * obj, uint8_t ADC)
{
	if (!obj) return;

	if (obj->samplingPin) {
		obj->samplingPin->Low();
	}

	if (!obj->SAMPLE_IN_EVERY_PWM_CYCLE) {
		if (ADC == 1) {
			obj->_DMA_ADC1_ongoing = 0;
			LL_ADC_REG_StopConversion(obj->hADC1.Instance);
		}
		else if (ADC == 2) {
			obj->_DMA_ADC2_ongoing = 0;
			LL_ADC_REG_StopConversion(obj->hADC2.Instance);
		}
	}

	if (obj->SAMPLE_IN_EVERY_PWM_CYCLE ||
	   (obj->_DMA_ADC1_ongoing == 0 && obj->_DMA_ADC2_ongoing == 0)) {
		uint16_t * buf;
		uint8_t nc;
		uint8_t numTriggers = obj->timerSettingsCurrent.Triggers.numEnabledTriggers;
		uint16_t bufSkip;
		uint32_t timestamp = HAL_GetHighResTick();
#ifdef USE_FREERTOS
		portBASE_TYPE xHigherPriorityTaskWoken = pdFALSE;
#endif

		if (obj->timerSettingsNext.InvalidateSamples == 0)
		{
			obj->Samples.Vref.UpdatedON = false;
			obj->Samples.Vref.UpdatedOFF = false;
			obj->Samples.CurrentSense.UpdatedON = false;
			obj->Samples.CurrentSense.UpdatedOFF = false;
			obj->Samples.Bemf.Updated = false;
			obj->Samples.Vbus.UpdatedON = false;
			obj->Samples.Vbus.UpdatedOFF = false;
			obj->Samples.Encoder.Updated = false;

			// Compute Vref voltage if sampled (based on __LL_ADC_CALC_VREFANALOG_VOLTAGE - with 12-bit ADC resolution)
			if (obj->Channels.VREF.ADC) {
				if (obj->Channels.VREF.ADC == 1) {
					buf = obj->_ADC1_buffer;
					nc = obj->Channels.ADCnumChannels[0];
				} else {
					buf = obj->_ADC2_buffer;
					nc = obj->Channels.ADCnumChannels[1];
				}
				bufSkip = nc * numTriggers;
				obj->Samples.Vref.Timestamp = timestamp;
				obj->Samples.Vref.UpdatedON = obj->timerSettingsCurrent.Triggers.ON.Enabled;
				obj->Samples.Vref.UpdatedOFF = obj->timerSettingsCurrent.Triggers.OFF.Enabled;

				if (obj->timerSettingsCurrent.Triggers.ON.Enabled) {
					obj->Samples.Vref.ValueON = 0;
					for (uint16_t i = 0, bufIdx = obj->Channels.VREF.Index + obj->timerSettingsCurrent.Triggers.ON.Index*nc;
						i < obj->timerSettingsCurrent.samplingNumSamples;
						i++, bufIdx += bufSkip)
					{
						obj->VrefON[i] = 0.001f * (float)((uint32_t)(*VREFINT_CAL_ADDR) * VREFINT_CAL_VREF) / (float)buf[bufIdx];
						obj->Samples.Vref.ValueON += obj->VrefON[i];
					}
					obj->Samples.Vref.ValueON /= obj->timerSettingsCurrent.samplingNumSamples;
					//obj->Samples.Vref.ValueON = 0.001f * (float)((uint32_t)(*VREFINT_CAL_ADDR) * VREFINT_CAL_VREF) / (float)buf[obj->Channels.VREF.Index + obj->timerSettingsCurrent.Triggers.ON.Index*nc];
				}

				if (obj->timerSettingsCurrent.Triggers.OFF.Enabled) {
					obj->Samples.Vref.ValueOFF = 0;
					for (uint16_t i = 0, bufIdx = obj->Channels.VREF.Index + obj->timerSettingsCurrent.Triggers.OFF.Index*nc;
						i < obj->timerSettingsCurrent.samplingNumSamples;
						i++, bufIdx += bufSkip)
					{
						obj->VrefOFF[i] = 0.001f * (float)((uint32_t)(*VREFINT_CAL_ADDR) * VREFINT_CAL_VREF) / (float)buf[bufIdx];
						obj->Samples.Vref.ValueOFF += obj->VrefOFF[i];
					}
					obj->Samples.Vref.ValueOFF /= obj->timerSettingsCurrent.samplingNumSamples;
					//obj->Samples.Vref.ValueOFF = 0.001f * (float)((uint32_t)(*VREFINT_CAL_ADDR) * VREFINT_CAL_VREF) / (float)buf[obj->Channels.VREF.Index + obj->timerSettingsCurrent.Triggers.OFF.Index*nc];
				}
			}

			if (obj->timerSettingsCurrent.Direction) { // Forward
				// Current sense from VSENSE1 since CH1 is LOW at all times
				if (obj->Channels.VSENSE1.ADC) {
					if (obj->Channels.VSENSE1.ADC == 1) {
						buf = obj->_ADC1_buffer;
						nc = obj->Channels.ADCnumChannels[0];
					} else {
						buf = obj->_ADC2_buffer;
						nc = obj->Channels.ADCnumChannels[1];
					}
					obj->Samples.CurrentSense.Timestamp = timestamp;
					obj->Samples.CurrentSense.UpdatedON = obj->timerSettingsCurrent.Triggers.ON.Enabled;
					obj->Samples.CurrentSense.UpdatedOFF = (obj->timerSettingsCurrent.Triggers.OFF.Enabled & (obj->_operatingMode == BRAKE)); // Current sense can only be sampled during OFF-period in BRAKE mode

					if (obj->timerSettingsCurrent.Triggers.ON.Enabled) {
						obj->Samples.CurrentSense.ValueON = 0;
						for (uint16_t i = 0, bufIdx = obj->Channels.VSENSE1.Index + obj->timerSettingsCurrent.Triggers.ON.Index*nc;
							i < obj->timerSettingsCurrent.samplingNumSamples;
							i++, bufIdx += bufSkip)
						{
							obj->Samples.CurrentSense.ValueON += obj->VrefON[i] * (float)buf[bufIdx] / 4096.f;
						}
						obj->Samples.CurrentSense.ValueON /= obj->timerSettingsCurrent.samplingNumSamples;
						if (obj->ChannelCalibrations.CurrentSense.Enabled)
							obj->Samples.CurrentSense.ValueON = obj->ChannelCalibrations.CurrentSense.VSENSE1.Scale * (obj->Samples.CurrentSense.ValueON - obj->ChannelCalibrations.CurrentSense.VSENSE1.Offset);
					}
					if (obj->Samples.CurrentSense.UpdatedOFF) {
						obj->Samples.CurrentSense.ValueOFF = 0;
						for (uint16_t i = 0, bufIdx = obj->Channels.VSENSE1.Index + obj->timerSettingsCurrent.Triggers.OFF.Index*nc;
							i < obj->timerSettingsCurrent.samplingNumSamples;
							i++, bufIdx += bufSkip)
						{
							obj->Samples.CurrentSense.ValueOFF += obj->VrefOFF[i] * (float)buf[bufIdx] / 4096.f;
						}
						obj->Samples.CurrentSense.ValueOFF /= obj->timerSettingsCurrent.samplingNumSamples;
						if (obj->ChannelCalibrations.CurrentSense.Enabled)
							obj->Samples.CurrentSense.ValueOFF = obj->ChannelCalibrations.CurrentSense.VSENSE1.Scale * (obj->Samples.CurrentSense.ValueOFF - obj->ChannelCalibrations.CurrentSense.VSENSE1.Offset);
					}
				}
			} else { // Backward
				// Current sense from VSENSE3 since CH3 is LOW at all times
				if (obj->Channels.VSENSE3.ADC) {
					if (obj->Channels.VSENSE3.ADC == 1) {
						buf = obj->_ADC1_buffer;
						nc = obj->Channels.ADCnumChannels[0];
					} else {
						buf = obj->_ADC2_buffer;
						nc = obj->Channels.ADCnumChannels[1];
					}
					obj->Samples.CurrentSense.Timestamp = timestamp;
					obj->Samples.CurrentSense.UpdatedON = obj->timerSettingsCurrent.Triggers.ON.Enabled;
					obj->Samples.CurrentSense.UpdatedOFF = (obj->timerSettingsCurrent.Triggers.OFF.Enabled & (obj->_operatingMode == BRAKE)); // Current sense can only be sampled during OFF-period in BRAKE mode

					if (obj->timerSettingsCurrent.Triggers.ON.Enabled) {
						obj->Samples.CurrentSense.ValueON = 0;
						for (uint16_t i = 0, bufIdx = obj->Channels.VSENSE3.Index + obj->timerSettingsCurrent.Triggers.ON.Index*nc;
							i < obj->timerSettingsCurrent.samplingNumSamples;
							i++, bufIdx += bufSkip)
						{
							obj->Samples.CurrentSense.ValueON += obj->VrefON[i] * (float)buf[bufIdx] / 4096.f;
						}
						obj->Samples.CurrentSense.ValueON /= obj->timerSettingsCurrent.samplingNumSamples;
						if (obj->ChannelCalibrations.CurrentSense.Enabled)
							obj->Samples.CurrentSense.ValueON = obj->ChannelCalibrations.CurrentSense.VSENSE3.Scale * (obj->Samples.CurrentSense.ValueON - obj->ChannelCalibrations.CurrentSense.VSENSE3.Offset);
					}
					if (obj->Samples.CurrentSense.UpdatedOFF) {
						obj->Samples.CurrentSense.ValueOFF = 0;
						for (uint16_t i = 0, bufIdx = obj->Channels.VSENSE3.Index + obj->timerSettingsCurrent.Triggers.OFF.Index*nc;
							i < obj->timerSettingsCurrent.samplingNumSamples;
							i++, bufIdx += bufSkip)
						{
							obj->Samples.CurrentSense.ValueOFF += obj->VrefOFF[i] * (float)buf[bufIdx] / 4096.f;
						}
						obj->Samples.CurrentSense.ValueOFF /= obj->timerSettingsCurrent.samplingNumSamples;
						if (obj->ChannelCalibrations.CurrentSense.Enabled)
							obj->Samples.CurrentSense.ValueOFF = obj->ChannelCalibrations.CurrentSense.VSENSE3.Scale * (obj->Samples.CurrentSense.ValueOFF - obj->ChannelCalibrations.CurrentSense.VSENSE3.Offset);
					}
				}
			}

			if (obj->_operatingMode == COAST) { // Back-EMF can only be sampled in OFF-period of COAST mode
				if (obj->timerSettingsCurrent.Direction) { // Forward
					// In forward direction it is CH3,CH3N that changes.
					// During COAST mode CH3N is forced to be LOW at all times, causing LOW PWM to deactivate the CH3,CH3N MOSFET
					// Back-EMF should thus be sampled from OUT3 = BEMF3
					if (obj->Channels.BEMF3.ADC) {
						if (obj->Channels.BEMF3.ADC == 1) {
							buf = obj->_ADC1_buffer;
							nc = obj->Channels.ADCnumChannels[0];
						} else {
							buf = obj->_ADC2_buffer;
							nc = obj->Channels.ADCnumChannels[1];
						}
						obj->Samples.Bemf.Timestamp = timestamp;
						obj->Samples.Bemf.Updated = obj->timerSettingsCurrent.Triggers.OFF.Enabled;
						if (obj->timerSettingsCurrent.Triggers.OFF.Enabled) {
							obj->Samples.Bemf.Value = 0;
							for (uint16_t i = 0, bufIdx = obj->Channels.BEMF3.Index + obj->timerSettingsCurrent.Triggers.OFF.Index*nc;
								i < obj->timerSettingsCurrent.samplingNumSamples;
								i++, bufIdx += bufSkip)
							{
								obj->Samples.Bemf.Value += obj->VrefOFF[i] * (float)buf[bufIdx] / 4096.f;
							}
							obj->Samples.Bemf.Value /= obj->timerSettingsCurrent.samplingNumSamples;
							if (obj->ChannelCalibrations.Bemf.Enabled) {
								if (obj->timerSettingsCurrent.BemfHighRange)
									obj->Samples.Bemf.Value = obj->ChannelCalibrations.Bemf.BEMF3.HighRange.Scale * (obj->Samples.Bemf.Value - obj->ChannelCalibrations.Bemf.BEMF3.HighRange.Offset);
								else
									obj->Samples.Bemf.Value = obj->ChannelCalibrations.Bemf.BEMF3.LowRange.Scale * (obj->Samples.Bemf.Value - obj->ChannelCalibrations.Bemf.BEMF3.LowRange.Offset);
							}
						}
					}
				} else { // Backward
					// In backward direction it is CH1,CH1N that changes.
					// During COAST mode CH1N is forced to be LOW at all times, causing LOW PWM to deactivate the CH1,CH1N MOSFET
					// Back-EMF should thus be sampled from OUT1 = BEMF1
					if (obj->Channels.BEMF1.ADC) {
						if (obj->Channels.BEMF1.ADC == 1) {
							buf = obj->_ADC1_buffer;
							nc = obj->Channels.ADCnumChannels[0];
						} else {
							buf = obj->_ADC2_buffer;
							nc = obj->Channels.ADCnumChannels[1];
						}
						obj->Samples.Bemf.Timestamp = timestamp;
						obj->Samples.Bemf.Updated = obj->timerSettingsCurrent.Triggers.OFF.Enabled;
						if (obj->timerSettingsCurrent.Triggers.OFF.Enabled) {
							obj->Samples.Bemf.Value = 0;
							for (uint16_t i = 0, bufIdx = obj->Channels.BEMF1.Index + obj->timerSettingsCurrent.Triggers.OFF.Index*nc;
								i < obj->timerSettingsCurrent.samplingNumSamples;
								i++, bufIdx += bufSkip)
							{
								obj->Samples.Bemf.Value += obj->VrefOFF[i] * (float)buf[bufIdx] / 4096.f;
							}
							obj->Samples.Bemf.Value /= obj->timerSettingsCurrent.samplingNumSamples;
							if (obj->ChannelCalibrations.Bemf.Enabled) {
								if (obj->timerSettingsCurrent.BemfHighRange)
									obj->Samples.Bemf.Value = obj->ChannelCalibrations.Bemf.BEMF1.HighRange.Scale * (obj->Samples.Bemf.Value - obj->ChannelCalibrations.Bemf.BEMF1.HighRange.Offset);
								else
									obj->Samples.Bemf.Value = obj->ChannelCalibrations.Bemf.BEMF1.LowRange.Scale * (obj->Samples.Bemf.Value - obj->ChannelCalibrations.Bemf.BEMF1.LowRange.Offset);
							}
						}
					}
				}
			}

			if (obj->Channels.VBUS.ADC) {
				if (obj->Channels.VBUS.ADC == 1) {
					buf = obj->_ADC1_buffer;
					nc = obj->Channels.ADCnumChannels[0];
				} else {
					buf = obj->_ADC2_buffer;
					nc = obj->Channels.ADCnumChannels[1];
				}

				obj->Samples.Vbus.Timestamp = timestamp;
				obj->Samples.Vbus.UpdatedON = obj->timerSettingsCurrent.Triggers.ON.Enabled;
				obj->Samples.Vbus.UpdatedOFF = obj->timerSettingsCurrent.Triggers.OFF.Enabled;
				if (obj->timerSettingsCurrent.Triggers.ON.Enabled) {
					obj->Samples.Vbus.ValueON = 0;
					for (uint16_t i = 0, bufIdx = obj->Channels.VBUS.Index + obj->timerSettingsCurrent.Triggers.ON.Index*nc;
						i < obj->timerSettingsCurrent.samplingNumSamples;
						i++, bufIdx += bufSkip)
					{
						obj->Samples.Vbus.ValueON += obj->VrefON[i] * (float)buf[bufIdx] / 4096.f;
					}
					obj->Samples.Vbus.ValueON /= obj->timerSettingsCurrent.samplingNumSamples;
					if (obj->ChannelCalibrations.Vbus.Enabled)
						obj->Samples.Vbus.ValueON = obj->ChannelCalibrations.Vbus.VBUS.Scale * (obj->Samples.Vbus.ValueON - obj->ChannelCalibrations.Vbus.VBUS.Offset);
				}

				if (obj->timerSettingsCurrent.Triggers.OFF.Enabled) {
					obj->Samples.Vbus.ValueOFF = 0;
					for (uint16_t i = 0, bufIdx = obj->Channels.VBUS.Index + obj->timerSettingsCurrent.Triggers.OFF.Index*nc;
						i < obj->timerSettingsCurrent.samplingNumSamples;
						i++, bufIdx += bufSkip)
					{
						obj->Samples.Vbus.ValueOFF += obj->VrefOFF[i] * (float)buf[bufIdx] / 4096.f;
					}
					obj->Samples.Vbus.ValueOFF /= obj->timerSettingsCurrent.samplingNumSamples;
					if (obj->ChannelCalibrations.Vbus.Enabled)
						obj->Samples.Vbus.ValueOFF = obj->ChannelCalibrations.Vbus.VBUS.Scale * (obj->Samples.Vbus.ValueOFF - obj->ChannelCalibrations.Vbus.VBUS.Offset);
				}
			}

