mindThomas/STM32-libraries/Periphirals/STM32G4/SyncedPWMADC/SyncedPWMADC.cpp
			// Sample Encoder if associated
			if (obj->_encoder) {
				obj->Samples.Encoder.Timestamp = timestamp;
				obj->Samples.Encoder.Updated = true;
				obj->Samples.Encoder.Value = obj->_encoder->Get();
			}

			if (obj->timerSettingsCurrent.BemfAlternateRange) {
				obj->timerSettingsCurrent.BemfHighRange = !obj->timerSettingsCurrent.BemfHighRange;
				obj->EnableBemfVoltageDivider(obj->timerSettingsCurrent.BemfHighRange); // enable voltage divider in high-range mode
			}

#ifdef USE_FREERTOS
			CombinedSample_t CombinedSample = {0};
			CombinedSample.Timestamp = timestamp;
			CombinedSample.PWM_Frequency = obj->timerSettingsCurrent.Frequency;
			CombinedSample.TimerMax = obj->timerSettingsCurrent.TimerMax;
			CombinedSample.DutyCycleLocation = obj->timerSettingsCurrent.DutyCycleLocation;
			CombinedSample.TriggerLocationON = obj->timerSettingsCurrent.Triggers.ON.Location;
			CombinedSample.TriggerLocationOFF = obj->timerSettingsCurrent.Triggers.OFF.Location;

			if (obj->Samples.CurrentSense.UpdatedON)
				CombinedSample.Current.ON = obj->Samples.CurrentSense.ValueON;
			if (obj->Samples.CurrentSense.UpdatedOFF)
				CombinedSample.Current.OFF = obj->Samples.CurrentSense.ValueOFF;

			if (obj->Samples.Bemf.Updated)
				CombinedSample.Bemf = obj->Samples.Bemf.Value;

			if (obj->Samples.Vbus.UpdatedON)
				CombinedSample.VbusON = obj->Samples.Vbus.ValueON;
			if (obj->Samples.Vbus.UpdatedOFF)
				CombinedSample.VbusOFF = obj->Samples.Vbus.ValueOFF;
			if (obj->Samples.Encoder.Updated)
				CombinedSample.Encoder = obj->Samples.Encoder.Value;

			if (uxQueueSpacesAvailableFromISR(obj->SampleQueue) > 0) { // check for space in queue
				xQueueSendFromISR(obj->SampleQueue, (void *)&CombinedSample, &xHigherPriorityTaskWoken);
			} else {
				obj->_missedSamples++;
			}

			if (obj->_sampleAvailable)
				xSemaphoreGiveFromISR( obj->_sampleAvailable, &xHigherPriorityTaskWoken );
#else
			_sampleAvailable = true;
#endif
		} else {
			obj->timerSettingsNext.InvalidateSamples--;
		}

		// Latch timer settings since we now start the next period
		if (obj->timerSettingsNext.Changed) {
#ifdef USE_FREERTOS
			if (xSemaphoreTakeFromISR( obj->_timerSettingsMutex, &xHigherPriorityTaskWoken )) {
#endif
				obj->timerSettingsNext.Changed = false;

				// Apply the changed timer settings that has to be latched
				obj->hTimer.Instance->RCR = obj->timerSettingsNext.samplingInterval - 1;

				if (obj->timerSettingsNext.BemfHighRange != obj->timerSettingsCurrent.BemfHighRange) {
					obj->EnableBemfVoltageDivider(obj->timerSettingsNext.BemfHighRange); // enable voltage divider in high-range mode
				}

				obj->timerSettingsCurrent = obj->timerSettingsNext;
#ifdef USE_FREERTOS
				xSemaphoreGiveFromISR( obj->_timerSettingsMutex, &xHigherPriorityTaskWoken );
			}
#endif
		}

#ifdef USE_FREERTOS
		portYIELD_FROM_ISR( xHigherPriorityTaskWoken );
#endif
	}
}
#pragma GCC pop_options

void SyncedPWMADC::Debug_SetSamplingPin(IO * pin)
{
	if (DEBUG_MODE_ENABLED && pin) {
		samplingPin = pin;
	}
}

void SyncedPWMADC::AssignEncoder(Encoder * encoder)
{
	if (encoder)
		_encoder = encoder;
}

void SyncedPWMADC::WaitForNewSample()
{
#ifdef USE_FREERTOS
	xSemaphoreTake( _sampleAvailable, ( TickType_t ) portMAX_DELAY );
#endif
	while (!_sampleAvailable) {
		osDelay(1);
	}
}

SyncedPWMADC::SampleFloat SyncedPWMADC::GetCurrent()
{
	return Samples.CurrentSense;
}

SyncedPWMADC::SampleFloat SyncedPWMADC::GetVin()
{
	return Samples.Vbus;
}

SyncedPWMADC::SampleSingleFloat SyncedPWMADC::GetBemf()
{
	return Samples.Bemf;
}

SyncedPWMADC::SampleSingleFloat SyncedPWMADC::GetPotentiometer()
{
	return SampleSingleFloat();
}

void SyncedPWMADC::DetermineCurrentSenseOffset()
{
	volatile float CurrentSenseOffset1 = 0;
	volatile float CurrentSenseOffset3 = 0;

	bool CalibrationEnabled = ChannelCalibrations.CurrentSense.Enabled;
	ChannelCalibrations.CurrentSense.Enabled = false; // disable calibration-compensation during calibration

	SetOperatingMode(BRAKE);
	SetNumberOfAveragingSamples(1);

	// Sample current sense in Forward direction (VSENSE1)
	{
		xSemaphoreTake( _timerSettingsMutex, ( TickType_t ) portMAX_DELAY ); // lock settings for change
		timerSettingsNext.Direction = true;
		xSemaphoreGive( _timerSettingsMutex ); // unlock settings
		SetDutyCycle_MiddleSamplingOnce(0.0f); // zero duty cycle during current-sense offset capture
		osDelay(10);

		// Wait for the queue to fill up
		uint16_t SampleCount = 0;
		CombinedSample_t sample;
		xQueueReset(SampleQueue);
		while (SampleCount < 100) {
			if (xQueueReceive( SampleQueue, &sample, ( TickType_t ) portMAX_DELAY ) == pdPASS) {
				if (sample.Current.OFF != 0) {
					CurrentSenseOffset1 += sample.Current.OFF; // Single trigger sampling configured and since duty cycle is OFF the sample would be put in the OFF field
					SampleCount++;
				}
			}
		}

		CurrentSenseOffset1 /= SampleCount;
	}
	ChannelCalibrations.CurrentSense.VSENSE1.Offset = CurrentSenseOffset1;

	// Sample current sense in Backward direction (VSENSE3)
	{
		xSemaphoreTake( _timerSettingsMutex, ( TickType_t ) portMAX_DELAY ); // lock settings for change
		timerSettingsNext.Direction = false;
		xSemaphoreGive( _timerSettingsMutex ); // unlock settings
		SetDutyCycle_MiddleSamplingOnce(0.0f); // zero duty cycle during current-sense offset capture
		osDelay(10);

		// Wait for the queue to fill up
		uint16_t SampleCount = 0;
		CombinedSample_t sample;
		xQueueReset(SampleQueue);
		while (SampleCount < 100) {
			if (xQueueReceive( SampleQueue, &sample, ( TickType_t ) portMAX_DELAY ) == pdPASS) {
				if (sample.Current.OFF != 0) {
					CurrentSenseOffset3 += sample.Current.OFF; // Single trigger sampling configured and since duty cycle is OFF the sample would be put in the OFF field
					SampleCount++;
				}
			}
		}
		CurrentSenseOffset3 /= SampleCount;
	}

	ChannelCalibrations.CurrentSense.Enabled = CalibrationEnabled;
	ChannelCalibrations.CurrentSense.VSENSE3.Offset = CurrentSenseOffset3;
}
